src/02_tools/cmake.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-30 Fri 10:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cmake</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="杨 睿" />
<link rel="stylesheet" type="text/css" href="https://yangruigit.gitee.io/my_blogs/lib/themes/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://yangruigit.gitee.io/my_blogs/lib/themes/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Cmake</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org118ef0f">1. 何为构建工具，何为 cmake</a></li>
<li><a href="#org701cf5a">2. CMakeLists.txt 编写准则</a>
<ul>
<li><a href="#orgc752296">2.1. 起手势</a></li>
<li><a href="#org0b317b6">2.2. 指定库和可执行文件</a></li>
<li><a href="#orga12a6c2">2.3. 编译选项</a>
<ul>
<li><a href="#orgec38a10">2.3.1. cmake 选项</a></li>
<li><a href="#org44bd8ff">2.3.2. 条件编译选项</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgdfec29d">3. 使用 FetchContent 高效配置依赖</a>
<ul>
<li><a href="#org7e7bd45">3.1. 目录结构</a></li>
<li><a href="#orgd8e7c4b">3.2. 根目录 CMakeLists.txt</a></li>
<li><a href="#org1beb418">3.3. opencv.cmake</a>
<ul>
<li><a href="#orge97c1eb">3.3.1. 从预编译包下载 opencv</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div align="right">
<a href="javascript:history.back()">返回</a>
</div>

<div id="outline-container-org118ef0f" class="outline-2">
<h2 id="org118ef0f"><span class="section-number-2">1</span> 何为构建工具，何为 cmake</h2>
<div class="outline-text-2" id="text-1">
<div class="warning">
<ul class="org-ul">
<li>本文不是 cmake 教程</li>
<li>本文仅是个人使用 cmake 的记录和心得</li>
</ul>

</div>

<p>
在依图的时候，横贯整个 Res 和 Eng，都在 <code>ficus</code> 这个项目中开发，整个项目估计得有几百万行代码、几千个内部 lib，当时是使用 <code>Scons</code> 进行构建的，个人觉得 <code>Scons</code> 最大的优点有：
</p>

<ul class="org-ul">
<li>纯 python 代码编写，无需再去学一门语法</li>
<li>针对大型项目的快速依赖解析</li>
</ul>

<div class="note">
<p>
所谓构建工具，简单的说，就是帮助开发者整合代码库和依赖关系，并最终编译代码文件，产出lib或可执行文件的工具
</p>

</div>

<p>
来下家公司后，开始接触 cmake，作为相对古老的构建工具，cmake有自己的闪光点，也有着时代的局限性。这里不讨论为什么会选择 cmake 而不是 scons 或者是 blaze，这里仅介绍 cmake。
</p>

<blockquote>
<p>
CMake 是个一个开源的跨平台自动化建构系统，用来管理软件建置的程序，并不依赖于某特定编译器，并可支持多层目录、多个应用程序与多个库。
</p>
</blockquote>

<p>
废话不多说，多了我也不知道，开始整理心得(坑)吧！
</p>
</div>
</div>

<div id="outline-container-org701cf5a" class="outline-2">
<h2 id="org701cf5a"><span class="section-number-2">2</span> CMakeLists.txt 编写准则</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgc752296" class="outline-3">
<h3 id="orgc752296"><span class="section-number-3">2.1</span> 起手势</h3>
<div class="outline-text-3" id="text-2-1">
<p>
相比 scons 对应的文件为 Sconscript，cmake 对应的文件名为 <code>CMakeLists.txt</code> ，首先，这个名字就很难记，几个地方大写，最后要加 <code>s</code> 还要加上毫无意义的后缀 <code>.txt</code> ，痛苦如斯！
</p>

<p>
新开一个项目时，我们需要定义项目根的 <code>CMakeLists.txt</code> , 一个项目最基本的，需要有名字和 cmake、CXX 指定版本。
</p>

<div class="org-src-container">
<pre class="src src-cmake">cmake_minimum_required(VERSION 3.15)
project(demo)

set(CMAKE_CXX_STANDARD 11)

# ...
</pre>
</div>

<p>
接下来和项目结构有关了，最常用的命令为：
</p>

<div class="org-src-container">
<pre class="src src-cmake"># 添加子目录 main，子目录内部包含 CMakeLists.txt，执行完这一句，你就可以用子目
# 录中的所有 lib 等成员
# 注意这里用了 shell 取值符 ${} cmake 中用法一致，但是 set value 的时候有区别
set(DIR_NAME main)
add_subdirectory(${DIR_NAME})

# 执行子 cmake，和 add_subdirectory 区别是一个给 cmake 文件，一个给目录，且
# include 的文件位置无要求，可以在项目外
include(${CMAKE_DIR}/test.cmake)
</pre>
</div>
</div>
</div>

<div id="outline-container-org0b317b6" class="outline-3">
<h3 id="org0b317b6"><span class="section-number-3">2.2</span> 指定库和可执行文件</h3>
<div class="outline-text-3" id="text-2-2">
<p>
编译的目的是什么，为了生成 target 文件，这个 target 包括了 lib、bin 等，需要通过如下命令指定
</p>

<div class="org-src-container">
<pre class="src src-cmake"># 遍历 demo 目录下所有文件
file(GLOB DEMO_SRC
  "${PROJECT_NAME}/demo/*.h"
  "${PROJECT_NAME}/demo/*.cpp"
  )

# 指定 lib，以及该 lib 的所有文件（用了上面的 DEMO_SRC）
# 默认为 STATIC
add_library(${PROJECT_NAME} [STATIC | SHARED | MODULE] ${DEMO_SRC})
# 指定头文件目录，SCOPE 可以为 PRIVATE INTERFACE 或 PUBLIC，区别是
#     - PRIVATE: 在 .cpp 中用到该lib，在 .h 中没用到该lib
#     - INTERFACE: 在 .cpp 中没用到该lib，在 .h 中用到该lib
#     - PUBLIC: 在 .cpp 中用到该lib，在 .h 中也用到该lib
target_include_directories(${PROJECT_NAME} ${SCOPE} ${头文件目录})
# 链接 lib
target_link_libraries(${PROJECT_NAME} ${SCOPE} ${lib名称})

# 指定可执行文件名称和代码
add_executable(run_test ${maincpp名称})
# 链接 lib
target_link_libraries(${PROJECT_NAME} ${SCOPE} ${lib名称})
</pre>
</div>
</div>
</div>

<div id="outline-container-orga12a6c2" class="outline-3">
<h3 id="orga12a6c2"><span class="section-number-3">2.3</span> 编译选项</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-orgec38a10" class="outline-4">
<h4 id="orgec38a10"><span class="section-number-4">2.3.1</span> cmake 选项</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">
<pre class="src src-cmake">option(BUILD_TEST "Option: BUILD Test" OFF)
if(BUILD_TEST)
  message("enable TEST")
  add_subdirectory(test)
endif()
</pre>
</div>
</div>
</div>

<div id="outline-container-org44bd8ff" class="outline-4">
<h4 id="org44bd8ff"><span class="section-number-4">2.3.2</span> 条件编译选项</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
cmake 文件中：
</p>
<div class="org-src-container">
<pre class="src src-cmake">set_property(DIRECTORY
  ${CMAKE_SOURCE_DIR} APPEND PROPERTY COMPILE_DEFINITIONS
  "__DEVICE_MODE__=1")
</pre>
</div>

<p>
cpp 文件中：
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-preprocessor">#define</span> <span class="org-variable-name">ANDROID</span> 1
<span class="org-preprocessor">#define</span> <span class="org-variable-name">APPLE</span> 2

<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
<span class="org-preprocessor">#if</span> __DEVICE_MODE__ == ANDROID
    <span class="org-keyword">return</span> build_android();
<span class="org-preprocessor">#elif</span> __DEVICE_MODE__ == APPLE
    <span class="org-keyword">return</span> build_apple();
<span class="org-preprocessor">#else</span>
    <span class="org-keyword">return</span> build();
}
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdfec29d" class="outline-2">
<h2 id="orgdfec29d"><span class="section-number-2">3</span> 使用 FetchContent 高效配置依赖</h2>
<div class="outline-text-2" id="text-3">
<p>
cpp 的依赖管理一直是很头痛的问题，我们希望：
</p>

<ol class="org-ol">
<li>在编译不同平台时候，可以自动切换该平台的依赖</li>
<li>依赖支持多种形式，可以是 submodule 编译，也可以是预编译的压缩包（可以在本地或云上）</li>
<li>方便的版本控制</li>
</ol>

<p>
cmake(&gt;=3.11a) 的 FetchContent 模块可以用来解决以上问题
</p>
</div>

<div id="outline-container-org7e7bd45" class="outline-3">
<h3 id="org7e7bd45"><span class="section-number-3">3.1</span> 目录结构</h3>
<div class="outline-text-3" id="text-3-1">
<p>
以 opencv 为例，我们只需要在每个架构 abi 目录下面，添加一个 opencv.cmake 文件，目录结构如下
</p>

<pre class="example">
.
├── CMakeLists.txt
├── cmake
│   └── Android
│       ├── aarch64
│       │   └── opencv.cmake
│       └── armv7-a
│           └── opencv.cmake
└── demo
</pre>
</div>
</div>

<div id="outline-container-orgd8e7c4b" class="outline-3">
<h3 id="orgd8e7c4b"><span class="section-number-3">3.2</span> 根目录 CMakeLists.txt</h3>
<div class="outline-text-3" id="text-3-2">
<p>
指定 SUB_CMAKE_ROOT，该变量根据编译平台不同自动切换
</p>
<div class="org-src-container">
<pre class="src src-cmake">set(SUB_CMAKE_ROOT ${CMAKE_SOURCE_DIR}/cmake/${CMAKE_SYSTEM_NAME}/${CMAKE_SYSTEM_PROCESSOR})

# include opencv.cmake 
include(${SUB_CMAKE_ROOT}/opencv.cmake)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1beb418" class="outline-3">
<h3 id="org1beb418"><span class="section-number-3">3.3</span> opencv.cmake</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-orge97c1eb" class="outline-4">
<h4 id="orge97c1eb"><span class="section-number-4">3.3.1</span> 从预编译包下载 opencv</h4>
<div class="outline-text-4" id="text-3-3-1">
<div class="org-src-container">
<pre class="src src-cmake">cmake_minimum_required(VERSION 3.11)
include(FetchContent)

set(LIB_NAME opencv)
FetchContent_Declare(
  ${LIB_NAME}
  URL https://nexus-h.tianrang-inc.com/repository/assets/opencv/opencv-mobile-3.4.13-android.zip
  )

FetchContent_GetProperties(opencv)
if (NOT ${LIB_NAME}_POPULATED)
  FetchContent_Populate(${LIB_NAME})
  FetchContent_MakeAvailable(${LIB_NAME})

  set(OpenCV_DIR ${${LIB_NAME}_SOURCE_DIR}/sdk/native/jni)
  find_package(OpenCV REQUIRED)
  target_link_libraries(${PROJECT_NAME} PUBLIC ${OpenCV_LIBS})
endif()
</pre>
</div>

<p>
其中，find_package 会去 OpenCV_DIR 中找对应的 cmake 文件并执行，该步骤可以替换为直接 link lib 和 include dir（如果我们事先知道的话），比如：
</p>

<div class="org-src-container">
<pre class="src src-cmake">file(GLOB OPENCV_LIBS
  "${${LIB_NAME}_SOURCE_DIR}/sdk/libs/lib*.a"
)
target_link_libraries(${PROJECT_NAME} PUBLIC ${OPENCV_LIBS})
target_include_directories(${PROJECT_NAME} PUBLIC ${${LIB_NAME}_SOURCE_DIR}/Headers/)
</pre>
</div>

<p>
当然，如果事先不知道，那么久交给 find_package 好了
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 杨 睿</p>
<p class="date">Created: 2022-12-30 Fri 10:49</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
